Repository: CofficLab/Lumi
Catalog: Packages/PluginInput/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Add
zh_hans: 添加
zh_hk: 新增

source: Add apps and corresponding input sources to automatically switch input methods when switching apps
zh_hans: 添加应用和对应的输入源，切换应用时自动切换输入法
zh_hk: 添加應用和對應的輸入源，切換應用時自動切換輸入法

source: Add New Rule
zh_hans: 新建规则
zh_hk: 新建規則

source: Add-rule card
zh_hans: 新建规则卡片
zh_hk: 新建規則卡片

source: Add-rule card: under 「Add New Rule」, pick an application and an input source, then click 「Add」.
zh_hans: 新建规则卡片：在「新建规则」下选择应用与输入源，然后点击「添加」。
zh_hk: 新建規則卡片：在「新建規則」下選擇應用與輸入源，然後點擊「新增」。

source: Application
zh_hans: 应用
zh_hk: 應用

source: Automatically switch input sources per application.
zh_hans: 按应用自动切换输入源。
zh_hk: 按應用自動切換輸入源。

source: Basic Operations
zh_hans: 基本操作
zh_hk: 基本操作

source: Choose an input source from 「Select Input Source」.
zh_hans: 从「选择输入源」选取输入源。
zh_hk: 從「選擇輸入源」選取輸入源。

source: Click 「Add」; the rule appears in the 「Rules」 list.
zh_hans: 点击「添加」，规则即显示在「规则」列表中。
zh_hk: 點擊「新增」，規則即顯示在「規則」列表中。

source: Delete
zh_hans: 删除
zh_hk: 刪除

source: Enable Auto Input Source Switching
zh_hans: 启用自动输入源切换
zh_hk: 啟用自動輸入源切換

source: Figure 1: Interface layout
zh_hans: 图 1 界面布局
zh_hk: 圖 1 介面佈局

source: Input Manager
zh_hans: 输入管理器
zh_hk: 輸入管理器

source: Input Source
zh_hans: 输入源
zh_hk: 輸入源

source: Interface
zh_hans: 界面说明
zh_hk: 介面說明

source: Manages the chat input area and text composition.
zh_hans: 管理聊天输入区与文本撰写。
zh_hk: 管理聊天输入区与文本撰写。

source: No input source switching rules
zh_hans: 暂无输入源切换规则
zh_hk: 暫無輸入源切換規則

source: Notes
zh_hans: 注意事项
zh_hk: 注意事項

source: Open the Input Manager tab in the sidebar.
zh_hans: 在侧边栏中打开「输入管理器」标签页。
zh_hk: 在側邊欄中開啟「輸入管理器」標籤頁。

source: Overview
zh_hans: 概述
zh_hk: 概述

source: Rules
zh_hans: 规则
zh_hk: 規則

source: Rules card
zh_hans: 规则卡片
zh_hk: 規則卡片

source: Rules card: lists the rules; each row shows an application and its input source. Right-click a row and choose 「Delete」 to remove it.
zh_hans: 规则卡片：列出全部规则，每行显示应用及其输入源；右键点击某行并选择「删除」即可移除该规则。
zh_hk: 規則卡片：列出全部規則，每行顯示應用及其輸入源；右鍵點擊某行並選擇「刪除」即可移除該規則。

source: Rules take effect only while the master switch is on.
zh_hans: 仅在总开关开启时规则才会生效。
zh_hk: 僅在總開關開啟時規則才會生效。

source: Select Application
zh_hans: 选择应用
zh_hk: 選擇應用

source: Select Input Source
zh_hans: 选择输入源
zh_hk: 選擇輸入源

source: Switch card
zh_hans: 开关卡片
zh_hk: 開關卡片

source: Switch card: the 「Enable Auto Input Source Switching」 toggle turns the feature on or off.
zh_hans: 开关卡片：「启用自动输入源切换」开关用于开启或关闭此功能。
zh_hk: 開關卡片：「啟用自動輸入源切換」開關用於開啟或關閉此功能。

source: The input source switches when the matched application comes to the foreground.
zh_hans: 当匹配的应用位于前台时，输入源才会切换。
zh_hk: 當匹配的應用位於前台時，輸入源才會切換。

source: This manual covers the interface and basic operations of the Input Manager: switching the input source automatically for each application.
zh_hans: 本手册介绍「输入管理器」的界面与基本操作：按应用自动切换输入源。
zh_hk: 本手冊介紹「輸入管理器」的介面與基本操作：按應用自動切換輸入源。

source: To remove a rule, right-click it and choose 「Delete」.
zh_hans: 如需移除规则，请右键点击该规则并选择「删除」。
zh_hk: 如需移除規則，請右鍵點擊該規則並選擇「刪除」。

source: Turn on 「Enable Auto Input Source Switching」.
zh_hans: 打开「启用自动输入源切换」。
zh_hk: 開啟「啟用自動輸入源切換」。

source: Under 「Add New Rule」, choose an application from 「Select Application」; running applications are listed.
zh_hans: 在「新建规则」中，从「选择应用」选取应用；列表中列出正在运行的应用。
zh_hk: 在「新建規則」中，從「選擇應用」選取應用；列表中列出正在執行的應用。

source: User Manual
zh_hans: 使用手册
zh_hk: 使用手冊

source: With no rules, the list shows 「No input source switching rules」.
zh_hans: 没有规则时，列表显示「暂无输入源切换规则」。
zh_hk: 沒有規則時，列表顯示「暫無輸入源切換規則」。

source: Core Capabilities
zh_hans: 核心能力
zh_hk: 核心能力

source: Where to Find It
zh_hans: 使用入口
zh_hk: 使用入口

source: Input area
zh_hans: 输入区
zh_hk: 輸入區

source: Composition
zh_hans: 文本合成
zh_hk: 文字合成

source: Chat Input
zh_hans: 聊天输入
zh_hk: 聊天輸入

source: The main input area for composing messages.
zh_hans: 撰写消息的主输入区。
zh_hk: 撰寫訊息的主輸入區。

source: Text Composition
zh_hans: 文本合成
zh_hk: 文字合成

source: Structured composition of user text.
zh_hans: 用户文本的结构化合成。
zh_hk: 使用者文字的結構化合成。

source: Input UI
zh_hans: 输入界面
zh_hk: 輸入介面

source: A dedicated view container for the input surface.
zh_hans: 专用的输入界面容器。
zh_hk: 專用的輸入介面容器。

source: Chat input bar
zh_hans: 聊天输入栏
zh_hk: 聊天輸入列
